str_ = input("Введите что-то: ")
str_ = list(str_)
a = (str_[3])
print("Первое условие равно: ",a ,)
b = (str_[2:-1]) 
print("Второе условие равно: ",b ,)
c = (str_[:5])
print("Третье условие равно: ",c ,)
d = (str_[0:-3])
print("Четвертое условие равно: ",d ,)
e = (str_[2:-1:2])
print("Пятое условие равно: ",e ,)
f = (str_[1:-1:2])
print("Шестое условие равно: ",f ,)
g = (str_[::-1])
print("Седьмое условие равно: ",g ,)
reverse_ = str_[::-1]
h = (reverse_[::2])
print("Восьмое условие равно: ",h ,)
list_length = len(str_)
print("Девятое условие равно: ", list_length ,)




